import asyncio  # Для асинхронного программирования
from aiogram import Bot, Dispatcher, types  # Основные компоненты aiogram для работы с Telegram API
from aiogram.filters import Command  # Для обработки команд (начинающихся с /)
from aiogram.types import ReplyKeyboardMarkup, KeyboardButton  # Для создания клавиатуры
import ram_bot  # Наш собственный модуль для парсинга автомобилей

TOKEN = '8388649740:AAHWOBHnZUZg-TeO4j1Z-7rYcpYXcsK4BRA'
# Создаем экземпляр бота с нашим токеном
bot = Bot(token=TOKEN)
# Создаем диспетчер для обработки входящих сообщений
dp = Dispatcher()

types_keyboard = ReplyKeyboardMarkup(
    keyboard=[
        # Первый ряд кнопок
        [KeyboardButton(text="DDR3"), KeyboardButton(text="DDR4"),KeyboardButton(text="DDR5")],
        [KeyboardButton(text="Все типы")]
    ],
    resize_keyboard=True  # Автоматически подгонять размер клавиатуры
)

# Обработчик команды /start
@dp.message(Command("start"))
async def start_command(message: types.Message):
    # Отправляем приветственное сообщение с клавиатурой
    await message.answer(
    "🚗 Привет! Я бот для поиска оперативной памяти на Avito.\n"
    "Выбери DDR тип памяти или нажми /help для списка команд.",
    reply_markup=types_keyboard  # Прикрепляем нашу клавиатуру
    )

# Основная асинхронная функция для запуска бота
async def main():
    # Запускаем опрос серверов Telegram на новые сообщения
    await dp.start_polling(bot)

# Точка входа в программу
if __name__ == "__main__":
    # Запускаем основную функцию в асинхронном режиме
    asyncio.run(main())

# Обработчик команды /help
@dp.message(Command("help"))
async def help_command(message: types.Message):
    # Отправляем сообщение со списком команд
    await message.answer(
        "Доступные команды:\n"
        "/start - начать работу с ботом\n"
        "/help - показать эту справку\n"
        "/type <тип> - поиск по конкретной типу\n\n"
        "Или просто выбери тип из кнопок ниже!",
        reply_markup=types_keyboard  # Снова показываем клавиатуру
    )

# Обработчик команды /type (например: /type Toyota)
@dp.message(Command("type"))
async def get_by_type_command(message: types.Message):
    try:
        # Разбиваем сообщение на части и берем второй элемент (марку)
        type = message.text.split()[1]
        # Вызываем функцию отправки списка автомобилей
        await send_ram_list(message, type)
    except IndexError:
        # Если пользователь не указал марку после команды
        await message.answer("Пожалуйста, укажите тип памяти после команды /type")

# Обработчик нажатий на кнопки с марками автомобилей
@dp.message(lambda message: message.text in ["DDR3", "DDR4", "DDR5","Все типы"])
async def handle_type_selection(message: types.Message):
    # Если выбрана кнопка "Все типы", передаем пустую строку как марку
    type = message.text if message.text != "Все типы" else ""
    # Вызываем функцию отправки списка автомобилей
    await send_ram_list(message, type)

# Функция для отправки списка автомобилей пользователю
async def send_ram_list(message: types.Message, type: str):
    try:
        # Отправляем сообщение о начале поиска
        await message.answer(f"🔍 Ищу объявления {f'по типу {type}' if type else 'по всем типам'}...")

        # Получаем данные автомобилей из нашего модуля ram_bot
        rams_data = ram_bot.get_rams(type)

        # Если данные получены
        if rams_data:
            # Перебираем все найденные автомобили
            for ram_info in rams_data:
                # Формируем текст сообщения с информацией об автомобиле
                response_text = (
                    f"💽 {ram_info['title']}\n"  # Название автомобиля
                    f"💰 Цена: {ram_info['price']} ₽\n"  # Цена
                    f"📊 {ram_info['params']}\n"  # Параметры (год, пробег и т.д.)
                    f"🔗 {ram_info['link']}\n"  # Ссылка на объявление
                    f"{'=' * 30}"  # Разделитель между объявлениями
                )
                # Отправляем сообщение с информацией об автомобиле
                await message.answer(response_text)
        else:
            # Если автомобили не найдены
            await message.answer("Не удалось найти объявления. Попробуйте другую тип.")

    except Exception as e:
        # Если произошла ошибка, отправляем сообщение с описанием ошибки
        await message.answer(f"Произошла ошибка: {str(e)}")

